clear;
clc;
close;
%根据DH矩阵构建机器人对象
L(1) = Link('d',  0.11815,'a',0,'alpha', -pi/2 ,'qlim',[-3*pi/2 3*pi/2]);%定义连杆
L(2) = Link('d', 0.00651,'a',-0.37 ,'alpha', 0,'qlim', [-17*pi/36 53*pi/36]);L(2).offset = pi/2;
L(3) = Link('d', 0,'a',-0.3035 ,'alpha', 0 ,'qlim',[-35*pi/36 35*pi/36]);
L(4) = Link('d', 0.1135,'a',0 ,'alpha', pi/2,'qlim', [-17*pi/36 53*pi/36]);L(4).offset = -pi/2;
L(5) = Link('d', 0.1135,'a',0 ,'alpha', -pi/2,'qlim', [-3*pi/2 3*pi/2]);
L(6) = Link('d', 0.107,'a',0 ,'alpha', 0,'qlim', [-3*pi/2 3*pi/2]);
%为连杆添加动力学参数
%连杆质量
L(1).m = 0.53717;L(2).m = 1.41;L(3).m = 0.74172;L(4).m = 0.45902;L(5).m = 0.50943;L(6).m = 0.10979;
%连杆质心位置
L(6).r = [-3.02E-11	4.30E-11	-0.017378];L(1).r = [-4.73E-08	-0.0027908	0.009627];
L(2).r = [0.185	-1.11E-08	0.14002];L(3).r = [0.068547	4.46E-06	0.0025763];
L(4).r = [-5.99E-10	-0.0045319	0.0019801];L(5).r = [2.29E-07	0.0052169	-0.0043802];
%连杆惯性张量
L(1).I = [0.0013059	0.0017703	0.0013242	-1.57E-08	6.64E-05	-7.10E-09];
L(2).I = [0.0035915	0.0057466	0.006604	1.52E-08	3.97E-10	-4.92E-10];
L(3).I = [0.0013931	0.003881	0.0039521	-1.05E-07	2.33E-09	-0.00010544];
L(4).I = [0.00091024	0.00089706	0.00096119	-1.05E-09	-4.52E-05	-7.87E-10];
L(5).I = [0.00097574	0.00097291	0.0010393	-2.20E-08	6.26E-05	1.38E-08];
L(6).I = [0.00010596	0.00010596	0.00017374	-3.28E-19	7.40E-14	-1.46E-13];
%各关节电机动力学参数
%电机惯量
L(1).Jm = 4.34E-4;L(2).Jm = 4.34E-4;L(3).Jm = 5.12E-5;L(4).Jm = 5.12E-5;L(5).Jm = 4.88E-5;L(6).Jm = 4.88E-5;
%关节摩擦
L(1).B = 9.25E-2;L(2).B = 9.25E-2;L(3).B = 4.23E-2;L(4).B = 4.23E-2;L(5).B = 4.75E-2;L(6).B = 4.75E-2;
%库仑摩擦
L(1).Tc = 7.61E-2;L(2).Tc = 7.61E-2;L(3).Tc = 3.19E-2;L(4).Tc = 3.19E-2;L(5).Tc = 3.25E-2;L(6).Tc = 3.25E-2;
%传动比
L(1).G = 50;L(2).G = 50;L(3).G = 50;L(4).G = 50;L(5).G = 50;L(6).G = 50;
R = SerialLink(L,'name','UR06');

q0 = [0 0 0 0 0 0];
w = [-0.7 0.7 -0.7 0.7 0 1];
light('position',[1 1 1],'color','w'); %打光
theta1=[0 0 0 0 0 0];    %机器人伸直且垂直
theta2=[pi 0 -pi/2 pi/2 pi/2 2*pi/3];
t=[0:0.01:2];
% ctraj:末端执行器直线运动;jtraj:关节运动
g=jtraj(theta1,theta2,t);
[q,qd,qdd] = jtraj(theta1,theta2,t);
% R.plot3d(g,'tilesize',0.1,'workspace',w,'wrist','path','E:\学习电子资源\大三下\机器人学\大作业\UR06_ultimate\meshes'...
% ,'trail',{'r'});%绘制动画,并保存为gif 'movie','路径规划.gif'

%关节位置、关节速度、关节加速度、各关节驱动力矩绘制
i=1:6;
figure(2);
subplot(2,2,1);
qplot(t, q(:,i));grid on;title('位置');ylabel('角度(rad)')%绘制每个关节位置
subplot(2,2,2);
qplot(t, qd(:,i));grid on;title('速度');ylabel('角速度(rad/s)')%绘制每个关节速度
subplot(2,2,3);
qplot(t, qdd(:,i));grid on;title('加速度');ylabel('角加速度(rad/s2)')%绘制每个关节加速度
M = R.rne(q,qd,qdd);%获得每个时间点所需要的关节力矩
subplot(2,2,4)
qplot(t,M);grid on;title('关节力矩');ylabel('力矩(N·m)')%绘制每个关节的力矩
% saveas(gcf, 'Rdynamics.jpg');

